{"keras_version": "2.3.1", "config": {"name": "sequential_1", "layers": [{"config": {"unroll": false, "recurrent_regularizer": null, "stateful": false, "dropout": 0.0, "kernel_constraint": null, "dtype": "float32", "unit_forget_bias": true, "recurrent_activation": "sigmoid", "trainable": true, "recurrent_dropout": 0.0, "recurrent_constraint": null, "name": "lstm_1", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "go_backwards": false, "activation": "tanh", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "units": 128, "return_sequences": false, "implementation": 2, "kernel_regularizer": null, "batch_input_shape": [null, 5, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"dtype": "float32", "activation": "linear", "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "bias_regularizer": null, "trainable": true, "name": "dense_1", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Sequential"}